_site/app/controllers/bus_routes_controller.rb

SELECT "bus_routes".* FROM "bus_routes"
---
  def index
    @bus_routes = BusRoute.all

SELECT  "bus_routes".* FROM "bus_routes" WHERE "bus_routes"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @bus_route = BusRoute.find(params[:id])

SELECT "bus_routes".* FROM "bus_routes"
SELECT  "bus_routes".* FROM "bus_routes" WHERE "bus_routes"."name" = ?  ORDER BY "bus_routes"."id" ASC LIMIT 1  [["name", "B"]]
INSERT INTO "bus_routes" ("name", "description", "direction_a", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "NX1"], ["description", "San Francisco - East Oakland"], ["direction_a", "Eastbound"], ["created_at", "2015-12-23 09:10:42.509585"], ["updated_at", "2015-12-23 09:10:42.509585"]]
---
  def refresh_bus_routes
    fetched_routes = ACTransitRails.get_all_routes
    fetched_routes.each do |route|
      if route["Description"].starts_with?("San Francisco -")
        bus_route = BusRoute.where(name: route["Name"]).first
        if bus_route.nil?
          fetched_directions = ACTransitRails.get_directions(route["Name"])
          new_bus_route = BusRoute.new(
            name: route["Name"],
            description: route["Description"],
            direction_a: fetched_directions[0],
            direction_b: fetched_directions[1]
          )
          new_bus_route.save